afc_saaspro_tax/afc_soap_apis/SOAP/CalcTaxInclusiveTaxes_PCode-Request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:tem="http://tempuri.org/" xmlns:ezt="http://schemas.datacontract.org/2004/07/EZTaxWebService">
   <soap:Header>
      <UserName xmlns="http://eztaxasp.billsoft.com/eztaxwebservice">*****</UserName>
      <Password xmlns="http://eztaxasp.billsoft.com/eztaxwebservice">*****</Password>
   </soap:Header>
   <soap:Body>
      <tem:CalcTaxInclusiveTaxes>
         <tem:aTransaction xmlns:a="http://schemas.datacontract.org/2004/07/EZTaxWebService" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
            <ezt:AdjustmentMethod>0</ezt:AdjustmentMethod>
            <ezt:BillToAddress i:nil="true"/>
            <ezt:BillToFipsCode i:nil="true"/>
            <ezt:BillToNpaNxx i:nil="true"/>
            <ezt:BillToPCode>2576800</ezt:BillToPCode>
            <ezt:BusinessClass>1</ezt:BusinessClass>
            <ezt:Charge>100</ezt:Charge>
            <ezt:Commit>true</ezt:Commit>
            <ezt:CompanyIdentifier>TST</ezt:CompanyIdentifier>
            <ezt:CountyExempt>false</ezt:CountyExempt>
            <ezt:CountyPCode>0</ezt:CountyPCode>
            <ezt:CustomerNumber>ABC</ezt:CustomerNumber>
            <ezt:CustomerType>1</ezt:CustomerType>
            <ezt:Date>2017-01-03T00:00:00</ezt:Date>
            <ezt:Debit>false</ezt:Debit>
            <ezt:DiscountType>0</ezt:DiscountType>
            <ezt:DocumentCode>Test Transaction 2017.07.01</ezt:DocumentCode>
            <ezt:ExemptionType>0</ezt:ExemptionType>
            <ezt:Exemptions i:nil="true"/>
            <ezt:FacilitiesBased>false</ezt:FacilitiesBased>
            <ezt:FederalExempt>false</ezt:FederalExempt>
            <ezt:FederalPCode>0</ezt:FederalPCode>
            <ezt:Franchise>false</ezt:Franchise>
            <ezt:Incorporated>true</ezt:Incorporated>
            <ezt:InvoiceNumber>345</ezt:InvoiceNumber>
            <ezt:IsPrivateLine>false</ezt:IsPrivateLine>
            <ezt:Lifeline>false</ezt:Lifeline>
            <ezt:Lines>1</ezt:Lines>
            <ezt:LocalExempt>false</ezt:LocalExempt>
            <ezt:LocalPCode>0</ezt:LocalPCode>
            <ezt:Locations>0</ezt:Locations>
            <ezt:Minutes>0</ezt:Minutes>
            <ezt:Optional>123456</ezt:Optional>
            <ezt:Optional10>10</ezt:Optional10>
            <ezt:Optional4>4</ezt:Optional4>
            <ezt:Optional5>5</ezt:Optional5>
            <ezt:Optional6>6</ezt:Optional6>
            <ezt:Optional7>7</ezt:Optional7>
            <ezt:Optional8>8</ezt:Optional8>
            <ezt:Optional9>9</ezt:Optional9>
            <ezt:OptionalAlpha1>Limit 20 bytes</ezt:OptionalAlpha1>
            <ezt:OriginationAddress i:nil="true"/>
            <ezt:OriginationFipsCode i:nil="true"/>
            <ezt:OriginationNpaNxx i:nil="true"/>
            <ezt:OriginationPCode>2576800</ezt:OriginationPCode>
           <ezt:OptionalFields>
               <ezt:OptionalField>
                  <ezt:OptionalKeyNo>1</ezt:OptionalKeyNo>
                  <ezt:OptionalValue>Sample CalcTaxInclusiveTaxes using PCode</ezt:OptionalValue>
               </ezt:OptionalField>
            </ezt:OptionalFields>
            <ezt:PrivateLineSplit>0.0</ezt:PrivateLineSplit>
            <ezt:Regulated>false</ezt:Regulated>
            <ezt:Sale>true</ezt:Sale>
            <ezt:ServiceClass>1</ezt:ServiceClass>
            <ezt:ServiceLevelNumber>888</ezt:ServiceLevelNumber>
            <ezt:ServiceType>1</ezt:ServiceType>
            <ezt:StateExempt>false</ezt:StateExempt>
            <ezt:StatePCode>0</ezt:StatePCode>
            <ezt:TerminationAddress i:nil="true"/>
            <ezt:TerminationFipsCode i:nil="true"/>
            <ezt:TerminationNpaNxx i:nil="true"/>
            <ezt:TerminationPCode>2576800</ezt:TerminationPCode>
            <ezt:TransactionType>1</ezt:TransactionType>
         </tem:aTransaction>
      </tem:CalcTaxInclusiveTaxes>
   </soap:Body>
</soap:Envelope>